# 1. Find Index Labels for min/max:**

               (a) label = df['col1'].idxmin()
               (b) label = df['col1'].idxmax()
               (c) df.nlargest(n,col_name)
               (d) df.nsmallest(n,col_name)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('CREATE_YOUR_DATA (Responses) - Form Responses 1.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Timestamp               31 non-null     object
 1   NAME                    31 non-null     object
 2   BATCH NUMBER            31 non-null     int64
 3   HOMETOWN                31 non-null     object
 4   HIGHEST QUALIFICATION   31 non-null     object
 5   FIELD OF STUDY          31 non-null     object
 6   COURSE REGISTERED       31 non-null     object
 7   IT EXPERIENCE           31 non-null     int64
 8   SALARY EXPECTATIONS     31 non-null     object
dtypes: int64(2), object(7)
memory usage: 2.3+ KB

In [4]:
df[df.duplicated()]

Empty DataFrame
Columns: [Timestamp, NAME, BATCH NUMBER , HOMETOWN, HIGHEST QUALIFICATION , FIELD OF STUDY, COURSE REGISTERED, IT EXPERIENCE, SALARY EXPECTATIONS ]
Index: []

In [6]:
df['IT EXPERIENCE'].min()

0

In [7]:
df['IT EXPERIENCE'].idxmin()

0

In [8]:
df['IT EXPERIENCE'].max()

6

In [9]:
df['IT EXPERIENCE'].idxmax()

1

In [10]:
df.nlargest(5,'IT EXPERIENCE')

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6

In [11]:
df.nsmallest(5,'IT EXPERIENCE')

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA

## Filtering Rows from a DataFrame
### Way 1
We can select the rows by using slicing operation.
### Syntax df[ starting_row_index : ending_row_index : step ]

### Way 2
Similar to numpy Pandas can accept boolean indexes.
To select rows based on a conditional expression, use a condition inside the selection brackets [].
### Syntax df[ CONDITION ]
- df[ df["maximum temperature"] > 95 ]
- df[df['date'].isin(['10-5-2016', '10-4-2016', '10-6-2016'])]
- df[ (df['date']=='10-5-2016') | 
    (df['date']=='10-4-2016') | 
    (df['date']=='10-6-2016') 
  ]

In [13]:
df[1:5]

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA

In [15]:
df[df['FIELD OF STUDY']=='Computer Science']

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa

In [16]:
df[df['FIELD OF STUDY']=='Computer Science']['NAME']

1               Chithari Ravi
12    vishnu Durga doddipatla
Name: NAME, dtype: object

In [18]:
df[df['IT EXPERIENCE']>=2]['NAME']

1             Chithari Ravi
21    MANTRI VAMSHI KRISHNA
29            Mahesh kuamar
Name: NAME, dtype: object

In [22]:
df[df['IT EXPERIENCE']>=2][['NAME','BATCH NUMBER ']]

                     NAME  BATCH NUMBER
1           Chithari Ravi            397
21  MANTRI VAMSHI KRISHNA            396
29          Mahesh kuamar            396

In [24]:
df[(df['BATCH NUMBER ']==396) & (df['HOMETOWN']=='Hyderabad')]['NAME']

9    Chiluka Suvarna
Name: NAME, dtype: object

In [25]:
df['HOMETOWN'].unique()

array(['Kamareddy', 'Hyderabad', 'Siddipet ', 'Vijayawada ', 'BHONGIR',
       'HYDERABAD', 'Amalapuram', 'nellore',
       'Andhra pradesh,Prakasam(dist),Darsi', 'MADHIRA', 'kakinada',
       'Amravati,Maharashtra', 'Narasaraopeta ', 'kirandul',
       'RAMAYAPATNAM IN AP', 'Hanamkonda ', 'Sangareddy', 'Rajamundry',
       'HYDERABAD ', 'Warangal', 'Karimnagar ',
       'Rajampet,Annamayya district,Andhra Pradesh', 'mupkal, nizamabad',
       'Hyderabad ', 'Guntur', 'Kodad'], dtype=object)

In [27]:
df[df['HOMETOWN'].isin(['Hyderabad','HYDERABAD','HYDERABAD ','Hyderabad '])]['NAME']

1             Chithari Ravi
5            D SAI SHREYAS
6        Chelikani Harshini
9           Chiluka Suvarna
16       Chelikani Harshini
21    MANTRI VAMSHI KRISHNA
23            SAI SHREYAS D
28                      sai
Name: NAME, dtype: object

In [28]:
df[df['NAME']=='Chelikani Harshini']

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA

In [19]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER ', 'HOMETOWN',
       'HIGHEST QUALIFICATION ', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS '],
      dtype='object')

# # What if I want a slice of 1 to 4 rows and 2 to 4 cols

In [33]:
df[1:5][0]

KeyError: 0

##  How to resolve this? ðŸ˜¢
In case, you want a subset of both rows and columns in one go, just using selection brackets [] is not sufficient anymore.
Here loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

## Syntax:
- df.loc[row_label, col_label]
- df.iloc[row_index, col_index]

In [34]:
df.loc[4]     # index base access

Timestamp                 6/27/2025 9:03:50
NAME                            VAMPU MANAS
BATCH NUMBER                            397
HOMETOWN                            BHONGIR
HIGHEST QUALIFICATION                 BTECH
FIELD OF STUDY                          ECE
COURSE REGISTERED              Data Science
IT EXPERIENCE                             0
SALARY EXPECTATIONS                   5 LPA
Name: 4, dtype: object

In [35]:
df.loc[1:4]

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA

In [36]:
df.loc[1:4,'NAME'] # only one column

1     Chithari Ravi
2    Ajay Erumalla
3       Rushikanth
4       VAMPU MANAS
Name: NAME, dtype: object

In [38]:
df.loc[1:4,['NAME','BATCH NUMBER ']]

             NAME  BATCH NUMBER
1   Chithari Ravi            397
2  Ajay Erumalla             397
3     Rushikanth             396
4     VAMPU MANAS            397

In [40]:
df.loc[1:4,'NAME':'COURSE REGISTERED']

,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED
1,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science
2,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science
3,Rushikanth,396,Vijayawada,Btech,ECE,Data Science
4,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science

In [41]:
df.loc[1:4,2]

KeyError: 2

In [42]:
df.iloc[1:4,2]

1    397
2    397
3    396
Name: BATCH NUMBER , dtype: int64

In [43]:
df.iloc[1:4,2:5]

   BATCH NUMBER      HOMETOWN HIGHEST QUALIFICATION
1            397    Hyderabad                  Btech
2            397    Siddipet                  B.Tech
3            396  Vijayawada                  Btech

In [50]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER ', 'HOMETOWN',
       'HIGHEST QUALIFICATION ', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS '],
      dtype='object')

####  Accessing rows based on a condition
- df.loc[CONDITION , col_lables ]

####  Accessing rows based on multiple condition
df.loc[ (COND_1) & (COND_2) | (COND_3) , col_lables ]

### condition based accessing without loc

In [44]:
df[df['FIELD OF STUDY']=='Computer Science']['NAME']

1               Chithari Ravi
12    vishnu Durga doddipatla
Name: NAME, dtype: object

In [45]:
df.loc[df['FIELD OF STUDY']=='Computer Science','NAME']

1               Chithari Ravi
12    vishnu Durga doddipatla
Name: NAME, dtype: object

# Multiple Conditions without using loc

In [46]:
df[(df['BATCH NUMBER ']==396) & (df['HOMETOWN']=='Hyderabad')]['NAME']

9    Chiluka Suvarna
Name: NAME, dtype: object

In [48]:
df.loc[(df['BATCH NUMBER ']==396)&(df['HOMETOWN']=='Hyderabad'),'NAME']

9    Chiluka Suvarna
Name: NAME, dtype: object

In [51]:
df.loc[(df['BATCH NUMBER ']==396)&(df['HOMETOWN']=='Hyderabad'),['NAME','HIGHEST QUALIFICATION ']]

              NAME HIGHEST QUALIFICATION
9  Chiluka Suvarna                 B.Tech